Repository: JoaoBontempo/HashPass
Catalog: lib/l10n/app_*.arb
Languages: pt

# closeAppConfirmationTitle
source: Close application?
pt: Fechar o aplicativo?

# closeAppConfirmationMessage
source: Are you sure to close HashPass?
pt: Tem certeza que deseja sair do HashPass?

# updatedDataMessage
source: All data successfully updated!
pt: Informações atualizadas com sucesso!

# newPasswordShowCase
source: Tap here to register a new password!
pt: Toque aqui para cadastrar uma nova senha!

# passwordFilterShowCase
source: Use this field to filter your passwords by title or credential
pt: Utilize este campo para filtrar suas senhas cadastradas por título ou por credencial

# passwordFilterPlaceholder
source: Search for title, credential...
pt: Pesquisar título, credencial...

# notFoundPassword
source: No passwords found!
pt: Nenhuma senha encontrada!

# noRegisteredPasswords
source: No passwords registered!
pt: Nenhuma senha foi cadastrada!

# registerNewPassword
source: Add new password
pt: Cadastrar nova senha

# simpleCardShowcase
source: Tap once to show the password. Tap and hold for a few seconds to copy it.
pt: Toque uma vez para visualizar a senha. Toque e segure por alguns segundos para copiar a senha.

# deletePasswordShowCase
source: Tap here to delete the password
pt: Toque aqui para excluir a senha

# editPasswordShwocase
source: Tap here to edit the password
pt: Toque aqui para editar as informações da senha

# defaultCardShowcase
source: You can edit some information in the card, such as password and credential. For the ciphered passwords, you are able to change the hash algorithm and the cipher mode as well.
pt: Você pode editar algumas informações no próprio card, como a credencial e a senha. Para senhas criptografadas, é possível alterar o algoritmo e o tipo de criptografia.

source: Credential
pt: Credencial

# emptyCredential
source: The credential should not be empty!
pt: A credencial não pode estar vazia!

source: Base password
pt: Senha base

source: Password
pt: Senha

# emptyPassword
source: The password should not be empty!
pt: A senha não pode estar vazia!

# shortPassword
source: The password is too short!
pt: A senha é curta demais!

source: Copy password
pt: Copiar senha

source: Hash Function
pt: Função Hash

source: Advanced
pt: Avançado

# showCardPassword
source: Show password
pt: Visualizar senha

# savePasswordShowcase
source: Tap here to save your password
pt: Toque aqui para salvar as informações da sua senha

# changePasswordMenu
source: Change master key
pt: Mudar senha geral

# exportImportDataMenu
source: Export/Import
pt: Exportar/Importar

# passworkLeakMenu
source: Password leak
pt: Vazamento de senha

# passworkLeakMenuNoAuthorized
source: To use the password leak verification, you should be connected to the internet.
pt: Não é possível utilizar a verificação de vazamento sem conexão com a internet.

source: Settings
pt: Configurações

source: Privacy policy
pt: Política de privacidade

source: About
pt: Sobre

# authNeeded
source: Authentication required
pt: Autenticação necessária

# setLastAppKey
source: Last master key:
pt: Informe sua senha antiga:

# appKey
source: Master key:
pt: Senha do aplicativo:

# keyAttempts
source: Invalid key! Attempts left:
pt: Chave inválida! Tentativas restantes:

# errorOcurred
source: An error ocurred:
pt: Ocorreu um erro:

# unlockNeeded
source: Unlock is required to get the master key
pt: O desbloqueio é necessário para recuperar a senha do aplicativo

source: Validate
pt: Validar

source: Seconds
pt: Segundos

# enterApp
source: Enter the app
pt: Entrar no app

source: Show password
pt: Mostrar senha

source: Hide password
pt: Ocultar senha

# useCredentialTooltip
source: Check this box if you want to save the credential that regards to the password. The credential might be your username, e-mail, some document number or something else that should be used along with the password
pt: Marque esta caixa caso deseje salvar a credencial relacionada a esta senha. A credencial pode ser seu nome de usuário, e-mail, CPF, ou qualquer outra informação que deve ser utilizada junto com a senha que deseja guardar

source: Save credential
pt: Salvar credencial

# useHashTooltip
source: Marking this box will make your password be the combination of a base password and a hash function applied on it
pt: Ao marcar esta caixa, sua senha real será a combinação entre uma senha base e um algoritmo hash.

source: Use Hash
pt: Usar Hash

source: Algorithm
pt: Algoritmo

source: Cipher mode
pt: Modo de criptografia

# normalCipherTooltip
source: Your password will be the base password with the hash function applied
pt: Sua senha final será a senha base com o algoritmo hash aplicado.

# advancedCipherTooltip
source: Beyond the hash function, your password will have an addictional symmetric cryptography
pt: Além do algoritmo hash, sua senha real terá uma criptografia simétrica adicional.

source: Save
pt: Salvar

source: Register password
pt: Cadastrar senha

source: Confirm
pt: Confirmar

# confirmPasswordSave
source: Are you sure you want to cancel the password editing?
pt: Tem certeza que deseja cancelar a edição da senha?

# confirmNewPasswordSave
source: Are you sure you want to cancel the password register?
pt: Tem certeza que deseja cancelar o cadastro da senha?

source: New password
pt: Nova senha

source: Edit password
pt: Alterar senha

# requiredTitle
source: Title is required
pt: O título é obrigatório

source: Title
pt: Título

# requiredPassword
source: Password is required!
pt: A senha é obrigatória!

# passwordMinimumSizeMessage
source: The password should have at least 4 characters!
pt: A senha deve ter no mínimo 4 caracteres

source: Register
pt: Cadastrar

source: Language
pt: Liguagem

# biometricConfigDescription
source: Configure the validation kind that the app will use to get the master key.
pt: Configura a forma de validação da senha geral do app para biometria ou texto.

# biometricConfigTitle
source: Biometric validation
pt: Validação biométrica

source: Theme
pt: Tema

# timerConfigDescription
source: Activate / deactivate the password visualization timer. If activated, it will limit the total amount of time that a password will be avaliable when it is shown.
pt: Ativar / desativar o temporizador de senha. O temporizador serve para limitar a quantidade de tempo que uma senha ficará disponível para visualização.

# timerConfigTitle
source: Password timer
pt: Temporizador de senha

# timerDurationConfigTitle
source: Timer duration
pt: Duração do temporizador

# timerDurationConfigDescription
source: Determines, in seconds, the duration of the password timer.
pt: Determina, em segundos, a duração do temporizador de senha.

# passworkLeakConfigDescription
source: Verifies if the password has been leaked on a few databases around the internet.
pt: Configurações relacionadas com a verificação das senhas informadas por você no aplicativo.

# insertPasswordLeakVerificationConfig
source: Activates real-time leak verification to register a password. Only verified passwords will be registered.
pt: Ativa a verificação em real-time ao cadastrar uma senha. Somente será possível cadastrar uma senha verificada.

# updatePasswordLeakVerificationConfig
source: Actives real-time leak verification to passwords already registered in the app. Only verified passwords will be updated.
pt: Ativa a verificação em real-time ao atualizar uma senha já cadastrada. Não será possível salvar uma senha não verificada.

# helpConfigDescription
source: Activate / deactivate help icons used to explain how the app works
pt: Habilita ou desabilita ícones de ajuda (?) para informações e explicações de ajuda a respeito de como o aplicativo funciona.

# helpConfigTitle
source: Help icons
pt: Habilitar ajuda

# cardStyleConfigTitle
source: Interface style
pt: Estilo de interface

# cardStyleConfigDescription
source: Determines the interface style of the app to list your passwords. The simple style is a minimalistic interface and the dafault will have more information on the screen
pt: Determina o estilo dos cards aplicativo ao listar suas senhas. O estilo simples será um card mais minimalista e o padrão será um card mais completo.

source: Simple
pt: Simples

source: Default
pt: Padrão

# registerVerifyTitle
source: Register verification
pt: Verificar ao cadastrar

# updateVerificationTitle
source: Update verification
pt: Verificar ao atualizar

# passwordShouldNotHaveSpacesMessage
source: The password should not have empty spaces!
pt: A senha não pode conter espaços!

# confirmPassword
source: Confirm your password
pt: Confirme sua senha

# notEqualPasswords
source: The provided passwords are not equal
pt: As senhas informadas não são iguais

# tryAgain
source: Try again, please.
pt: Por favor, tente novamente.

# changeGeneralKeySuccess
source: HashPass master key successfully updated!
pt: Senha geral do HashPass alterada com sucesso!

# dataExportSuccessMessage
source: Your passwords were exported sucessfully! Use the token below to import it.
pt: Seus dados foram exportados com sucesso! Você deverá usar a chave abaixo para importar seus dados.

# dataExportSuccessTitle
source: Data sucessfully exported!
pt: Dados exportados com sucesso!

# dataImportSuccessTitle
source: Data sucessfully imported!
pt: Dados importados com sucesso!

source: Copy token
pt: Copiar token

source: Data export
pt: Exportação de dados

source: Data import
pt: Importação de dados

# dataExportExplanation
source: A text file containing your passwords. It will be ciphered with a random generated token. You will be able to export this file to the place of your preference and copy the generated token. The token will be required to decipher the content of the file to import it into another device.
pt: Será gerado um arquivo contendo suas senhas, criptografado com uma chave gerada aleatoriamente. Você poderá exportar este arquivo para o lugar de sua preferência e copiar a chave aleatória que foi gerada. A chave será necessária para decifrar o conteúdo do arquivo criptografado do arquivo na importação de dados.

# dataImportExplanation
source: Insert the token generated at the time you exported your passwords and press the 'Import' button. Choose the text file containing your ciphered passwords. Make sure you are using the correct token and file. Your HashPass master key should be the same you were using when you exported your data. Access to your files will be required.
pt: Insira a chave criptográfica que foi gerada ao exportar os dados e pressione o botão 'Importar dados'. Selecione o arquivo que contém seus dados para que seja possível a importação. Certifique-se de que você está usando a chave e o arquivo corretos e que sua chave geral do HashPass é a mesma de quando você exportou os dados. Será necessário permitir o acesso aos arquivos do dispositivo.

# doNotShareToken
source: Do not share your token or your file with nobody!
pt: Não compartihe seu token e não envie o arquivo para ninguém!

source: Export
pt: Exportar

source: Import
pt: Importar

# insertExportToken
source: Insert your token
pt: Insira seu token

# emptyFieldMessage
source: This field should not be empty
pt: Este campo não pode estar vazio

# chooseImportFile
source: Choose a file to import
pt: Selecione o arquivo para importação

source: Access denied
pt: Acesso negado

# fileAccessRequired
source: Access to the files of your device is required to import data.
pt: Para importar seus dados, é necessário permitir o acesso aos arquivos do dispositivo.

# unknowErrorToOpenFile
source: An unknown error ocurred to open the file
pt: Erro desconhecido ao abrir o arquivo

# unknowErrorToOpenFileManager
source: An unknown error ocurred to open the file manager
pt: Ocorreu um erro inesperado ao abrir o gerenciador de arquivos.

# dataImportCanceled
source: No file selected. Data import canceled
pt: Importação cancelada. Nenhum arquivo foi selecionado

# dataImportErrorMessage
source: An unexpected error ocurred during data import process. Please, try again. *Check if your token is correct *Check if the selected file is the right one for this token *Check your master key. It should be the same as when you exported the passwords
pt: Um erro inesperado ocorreu ao importar seus dados. Por favor, tente novamente * Verifique se a chave inserida está correta * Verifique se o arquivo selecionado é o correto para esta chave * Verifique se sua chave geral do app é a mesma de quando você exportou os arquivos

# insertPasswordToBeVerified
source: Insert your password to be verified on a few leak databases around the internet
pt: Informe uma senha para que ela seja verificada em bases de dados de senhas que já foram vazadas na internet.

# typePassword
source: Type your password
pt: Digite sua senha

source: Verify password
pt: Verificar senha

source: Version
pt: Versão

# aboutHashPass
source: HashPass is a user-friendly mobile application to store and manage your passwords securely, using complex cryptography
pt: HashPass é um software que tem o objetivo de ser uma solução simples para armazenar as senhas dos seus apps e serviços de forma segura, utilizando criptografia.

source: Developed by
pt: Desenvolvido por

# generalKeyRegistered
source: Master key sucessfully registered!
pt: Chave cadastrada com sucesso!

# setFirstConfigMessage
source: HashPass have some settings to personalize your experience with the app, such as a password visualization timer, leak verification , help icons and more. Do you like to use the default settings and set your preferences further or do you want to configure it right now?
pt: O HashPass possui algumas configurações para que sua experiência com o app seja personalizada, como temporizador de visualização de senha, verificação de vazamento de senha, ícones de ajuda, dentre outras opções. Deseja utilizar as configurações padrão e alterá-las posteriormente ou deseja configurar o app agora?

# useDefaultConfig
source: Use default settings
pt: Usar configurações padrão

# configTheApp
source: I want to configure the app
pt: Quero configurar o app

# start
source: Use HashPass
pt: Começar

# appReady
source: Everything is ready!
pt: Tudo certo!

source: Initial settings
pt: Configurações iniciais

source: Next
pt: Continuar

# welcome
source: Welcome to HashPass!
pt: Bem vindo ao HashPass!

# shouldAgreePolicy
source: To use HashPass, you should agree with our privacy policy terms
pt: Para continuar, é necessário concordar com os termos da política de privacidade do aplicativo.

# registerGeneralKeyError
source: An unknown error occured to register your master key. Try again, please.
pt: Um erro desconhecido ocorreu ao cadastrar sua senha geral. Por favor, tente novamente.

# agreeWithTerms
source: I agree with HashPass
pt: Concordo com os termos da

# insertGeneralKey
source: Insert a master key
pt: Informe uma senha geral

# welcomeParagraphOne
source: HashPass is a mobile application developed to store and manage your passwords in a truly secure way. To reach this objective, a master key is required, because your passwords will be locally stored using symmetric cryptography. Therefore, a single password is responsable to retrieve all of your passwords, so that is the only thing you need to remember.
pt: HashPass é um aplicativo criado para guardar suas senhas de forma segura. Para isso, será necessário criar uma senha geral para o app, pois suas senhas serão armazenadas com criptografia simétrica, sendo assim, uma única senha é responsável por recuperar todas suas senhas, ou seja, ela é a única coisa que você deverá lembrar.

# welcomeParagraphTwo
source: It will not be possible to recover the master key, so keep it safe and remember to never share it.
pt: Não será possível recuperar esta senha, portanto, guarde sua senha geral e não esqueça ou compartilhe esta senha de forma alguma.

# welcomeParagraphThree
source: You will be able to access your password with biometric validation if your device supports this feature.
pt: Você poderá acessá-la com sua biometria posteriormente, caso seu dispositivo suporte esse recurso.

# darkTheme
source: Dark
pt: Escuro

# lightTheme
source: Light
pt: Padrão

# autoTheme
source: System Default
pt: Automático (Sistema)

# decipherFailure
source: An error ocurred to decipher the password
pt: Erro ao decifrar a senha

# passwordSuccessRegister
source: Password successfully registered!
pt: Senha cadastrada com sucesso!

# passwordSuccessUpdate
source: Password successfully updated!
pt: Senha atualizada com sucesso!

source: Password copied
pt: Senha copiada!

# passwordRecoverError
source: An error ocurred to retrieve your password
pt: Ocorreu um erro ao recuperar sua senha

# confirmDelete
source: Confirm deleting
pt: Confirmar exclusão

# confirmDeleteMessage
source: Are you sure you want to delete this password? There is no way to undo this action.
pt: Você tem certeza que deseja excluir esta senha? Esta ação não poderá ser desfeita.

# deleteSuccess
source: Password successfully deleted!
pt: Senha excluída com sucesso!

# deleteError
source: An error ocurred to delete the password. Try again, please
pt: Ocorreu um erro ao excluir a senha. Por favor, tente novamente

source: Leaked password
pt: Senha vazada

# notVerifiedPassword
source: Password is not verified
pt: Senha não verificada

# confirmSaveLeakedPassword
source: You are trying to save a password that has been leaked already. Are you sure to save this password?
pt: A senha que você está tentando salvar já foi vazada! Você deseja salvá-la mesmo assim?

# confirmSaveNotVerifiedPassword
source: It was not possible to verify your password because some error ocurred or there is no internet connection. Are you sure to save this password?
pt: Não foi possível verificar sua senha, pois um erro ocorreu ou não há conexão com a internet. Deseja salvar sua senha mesmo assim?

# confirmSavePassword
source: Are you sure to update this password?
pt: Tem certeza que deseja atualizar os dados desta senha?

source: Yes
pt: Sim

source: No
pt: Não

# updateAndInsertLeakConfigDescription
source: Activate / deactivate leak verification to register or update a password
pt: Ativar / desativar a verificação de vazamento de senha ao cadastrar e ao atualizar uma senha.

# couldNotVerifyPassword
source: Was not possible to verify your password. Please, check your internet connection
pt: Não foi possível verificar sua senha. Verifique sua conexão de internet ou tente novamente.

# passwordLeakedOnce
source: This passwork has been leaked at least once!
pt: Esta senha foi vazada pelo menos uma vez!

# passwordMaybeNotLeaked
source: Your password has a great chance of not ever been leaked
pt: Sua senha tem grandes chances de não ter sido vazada!

# passwordLeakedMoreThanOnce
source: This passwork has been leaked at least
pt: Esta senha foi vazada pelo menos

source: times
pt: vezes

source: Path Notes
pt: Notas de atualização

# pathNotesIntroduction
source: See the version path notes below
pt: Seguem abaixo as notas da atualização

# update1_3_0_title
source: HashPass version 1.3.0 has arrived! There are some new features for you!
pt: A versão 1.3.0 do HashPass chegou!

# update1_3_0_description
source: This is the first update of the app since I developed and published it while I was at the University
pt: Esta é a primeira atualização do aplicativo desde que o desenvolvi e publiquei enquanto estava na faculdade. Algumas novas ideias e surgiram e esta é apenas uma pequena atualização de preparação para algo ainda melhor que está por vir! Muito orbigado por utilizar o HashPass!

# update1_3_0_note1
source: New feature: Password generation (access it on the aside menu). Gerenate a random and secure password then save it;
pt: Nova função: Gerador de senha (presente no menu lateral). Gere uma senha segura e salve-a no HashPass;

# update1_3_0_note2
source: HashPass is now avaliable in English!. You can swap the language between Portuguese (BR) and English (US).
pt: O HashPass agora está internacionalizado. Você pode alterar a linguagem do aplicativo para Português (BR) ou Inglês (US).

# passwordGeneratorMenu
source: Password generator
pt: Gerador de senha

source: Password size
pt: Tamanho da senha

source: Lowercases
pt: Minúsculas

source: Uppercases
pt: Maiúsculas

source: Numbers
pt: Números

source: Symbols
pt: Sìmbolos

# charBlackList
source: Character blacklist
pt: Lista negra de caracteres

# blackListDescription
source: Every character at the blacklist will not came into the generated password
pt: Os caracteres contidos neste campo não farão parte da senha gerada

source: Generate password
pt: Gerar senha

source: Password details
pt: Detalhes da senha

source: Generated password
pt: Senha gerada

source: Invalid parameters
pt: Parametros inválidos

# everyDigitOnBlacklist
source: It is impossible to generate a password using only numbers if every number ([0-9]) are in the blacklist.
pt: Não é possível gerar uma senha contendo somente números se todos os algarismos ([0-9]) estiverem na lista negra.
